### I hope you have learned about pandas in a quite good manner , now its time to move on to a test for it. Here you are provided with some questions of which you need to write the code and test your understanding of the concept.

In [1]:
import pandas as pd
import numpy as np

### Q1.

```
import numpy as np
mylist = list('abcedfghijklmnopqrstuvwxyz')
myarr = np.arange(26)
mydict = dict(zip(mylist, myarr))
```
**Write code to convert the above mydict variable into dataframe , your code should return a dataframe like below.**

```
a    0
b    1
c    2
d    4
```

In [152]:
mylist = list('abcedfghijklmnopqrstuvwxyz')
myarr = np.arange(26)
mydict = dict(zip(mylist, myarr))

In [158]:
df_ = pd.DataFrame(list(mydict.items()))  
df_

    0   1
0   a   0
1   b   1
2   c   2
3   e   3
4   d   4
5   f   5
6   g   6
7   h   7
8   i   8
9   j   9
10  k  10
11  l  11
12  m  12
13  n  13
14  o  14
15  p  15
16  q  16
17  r  17
18  s  18
19  t  19
20  u  20
21  v  21
22  w  22
23  x  23
24  y  24
25  z  25

### Q2. Write the code to get frequency count of each character from the result of below command
```
ser = pd.Series(np.take(list('abcdefgh'), np.random.randint(8, size=30)))
```

In [3]:
## your output should look like this.

f    7
c    5
g    4
b    4
h    4
e    3
a    3
dtype: int64

In [3]:
ser = pd.Series(np.take(list('abcdefgh'), np.random.randint(8, size=30)))

In [4]:
ser.value_counts()

g    5
a    5
h    5
d    5
b    3
f    3
e    3
c    1
dtype: int64

### Q3. What parameter to do we need to add in read_csv, which let us read only a bunch of columns from the whole dataset.

In [ ]:
# just write that parameter name here

In [ ]:
columns = ['col1', 'col2', 'col3']

df = pd.read_csv('your_file.csv', usecols=columns)

<p style="color:brown;">For Next 3 question you need to work on fruits sample dataset provided in resources.</p>

In [4]:
# read fruits.csv file

### Q4. Get mean, median, max , min price for each fruit .

In [9]:
# Your output should look like this

   Fruit Name        mean  median  max
0      Banana   98.500000    98.5  112
1       Mango  106.666667   100.0  160
2   PineApple  187.500000   187.5  285
3  Strawberry  200.000000   200.0  200

In [137]:
fruits= pd.read_csv("fruits.csv")

In [138]:
#fruits
df=pd.DataFrame(fruits)
result = df.groupby('Fruit Name').agg({'Price': ['mean', 'median', 'max', 'min']})
result

                 Price
                  mean median  max  min
Fruit Name
Banana       98.500000   98.5  112   85
Mango       106.666667  100.0  160   60
PineApple   187.500000  187.5  285   90
Strawberry  200.000000  200.0  200  200

In [22]:
#or
group=fruits.groupby('Fruit Name')

In [23]:
group.describe()

           Quantity                                                         \
              count   mean        std    min     25%    50%     75%    max
Fruit Name
Banana          2.0   49.0  41.012193   20.0   34.50   49.0   63.50   78.0
Mango           3.0   35.0   8.660254   25.0   32.50   40.0   40.00   40.0
PineApple       2.0   32.5  24.748737   15.0   23.75   32.5   41.25   50.0
Strawberry      1.0  100.0        NaN  100.0  100.00  100.0  100.00  100.0

           Price
           count        mean         std    min     25%    50%     75%    max
Fruit Name
Banana       2.0   98.500000   19.091883   85.0   91.75   98.5  105.25  112.0
Mango        3.0  106.666667   50.332230   60.0   80.00  100.0  130.00  160.0
PineApple    2.0  187.500000  137.885822   90.0  138.75  187.5  236.25  285.0
Strawberry   1.0  200.000000         NaN  200.0  200.00  200.0  200.00  200.0

### Q5. What is the total cost of this basket?

In [10]:
#your output should be this

1092

In [30]:
#fruits

In [27]:
fruits['Price'].sum()

1092

### Q6. Which fruit has the maximum price per quantity?

In [13]:
# your output should be

'PineApple'

In [55]:
df['price_per_quantity'] = df['Price'] / df['Quantity']

max_price_fruit = df.loc[df['price_per_quantity'].idxmax(), 'Fruit Name']

In [56]:
max_price_fruit

'PineApple'

### Q7. Given an array 
```arr = [ 0,1,0,1,0,2,3,6,5,0,0,0,4,1,2,3,5,5,4,4 ]```
<br>
**Write code to  Create one_hot encoded dataframe of this array.**

In [18]:
#your output should be like this and should have 20 records in total

   0  1  2  3  4  5  6
0  1  0  0  0  0  0  0
1  0  1  0  0  0  0  0
2  1  0  0  0  0  0  0
3  0  1  0  0  0  0  0
4  1  0  0  0  0  0  0

In [61]:
arr = [0, 1, 0, 1, 0, 2, 3, 6, 5, 0, 0, 0, 4, 1, 2, 3, 5, 5, 4, 4]

series = pd.Series(arr)

one_hot_encoded_df = pd.get_dummies(series, prefix="")

print(one_hot_encoded_df)

    _0  _1  _2  _3  _4  _5  _6
0    1   0   0   0   0   0   0
1    0   1   0   0   0   0   0
2    1   0   0   0   0   0   0
3    0   1   0   0   0   0   0
4    1   0   0   0   0   0   0
5    0   0   1   0   0   0   0
6    0   0   0   1   0   0   0
7    0   0   0   0   0   0   1
8    0   0   0   0   0   1   0
9    1   0   0   0   0   0   0
10   1   0   0   0   0   0   0
11   1   0   0   0   0   0   0
12   0   0   0   0   1   0   0
13   0   1   0   0   0   0   0
14   0   0   1   0   0   0   0
15   0   0   0   1   0   0   0
16   0   0   0   0   0   1   0
17   0   0   0   0   0   1   0
18   0   0   0   0   1   0   0
19   0   0   0   0   1   0   0

### Q8. 
```
dict_ = {'First Score':[100, 90, np.nan, 95],
        'Second Score': [30, 45, 56, np.nan],
        'Third Score':[np.nan, 40, 80, 98]

```
#### a. Convert this above dict to pandas dataframe

In [22]:
#your output should be like this

   First Score  Second Score  Third Score
0        100.0          30.0          NaN
1         90.0          45.0         40.0
2          NaN          56.0         80.0
3         95.0           NaN         98.0

In [13]:
dict_ = {'First Score': [100, 90, np.nan, 95],
         'Second Score': [30, 45, 56, np.nan],
         'Third Score': [np.nan, 40, 80, 98]}

df = pd.DataFrame(dict_)
print(df)

   First Score  Second Score  Third Score
0        100.0          30.0          NaN
1         90.0          45.0         40.0
2          NaN          56.0         80.0
3         95.0           NaN         98.0

#### b. Write code to get the number of missing values for each column.

In [23]:
#your output should be like this

First Score     1
Second Score    1
Third Score     1
dtype: int64

In [15]:
missing_values = df.isnull().sum()
missing_values

First Score     1
Second Score    1
Third Score     1
dtype: int64

#### c. Fill this nan values with mean value of their respective column

In [27]:
#your output should be like this

   First Score  Second Score  Third Score
0        100.0     30.000000    72.666667
1         90.0     45.000000    40.000000
2         95.0     56.000000    80.000000
3         95.0     43.666667    98.000000

In [16]:
df_filled = df.fillna(df.mean())
df_filled

   First Score  Second Score  Third Score
0        100.0     30.000000    72.666667
1         90.0     45.000000    40.000000
2         95.0     56.000000    80.000000
3         95.0     43.666667    98.000000

### Q9. Add an index column to the table used in Q4.
*HINT : Rest index*

In [28]:
#your output should be like this

   index  Fruit Name  Quantity  Price  price/quantity
0      0      Banana        78    112        1.435897
1      1       Mango        40    160        4.000000
2      2      Banana        20     85        4.250000
3      3   PineApple        15     90        6.000000
4      4  Strawberry       100    200        2.000000
5      5       Mango        25     60        2.400000
6      6       Mango        40    100        2.500000
7      7   PineApple        50    285        5.700000

In [144]:
df['price/quantity'] = df['Price'] / df['Quantity']

df['index'] = range(0, len(df))

df

   Fruit Name  Quantity  Price  price/quantity  index
0      Banana        78    112        1.435897      0
1       Mango        40    160        4.000000      1
2      Banana        20     85        4.250000      2
3   PineApple        15     90        6.000000      3
4  Strawberry       100    200        2.000000      4
5       Mango        25     60        2.400000      5
6       Mango        40    100        2.500000      6
7   PineApple        50    285        5.700000      7

### Q10. 
**You are provided wih two different csv files ,**
```
sample_sheet_1.csv
sample_sheet_2.csv 
```
<p>
    
**You just need to read both of them , and merge them based on location column.**

In [30]:
#your output should be like this

  Location Population  ...  No. of shops Weekly market day
0      ABB   2.5 lakh  ...           150   Nothing as such
1      ABC   1.5 lakh  ...           120           Tuesday
2      CDD   3.5 lakh  ...           180         Wednesday

[3 rows x 6 columns]

In [145]:
sample_sheet_1= pd.read_csv("sample_sheet_1.csv")
sample_sheet_2= pd.read_csv("sample_sheet_2.csv")

In [146]:
sample_sheet_1

  Location Population  House_count Location Area
0      ABB   2.5 lakh          763    25 hectare
1      ABC   1.5 lakh          520    20 hectare
2      CDD   3.5 lakh          800    35 hectare

In [147]:
sample_sheet_2

  Location  No. of shops Weekly market day
0      ABB           150   Nothing as such
1      ABC           120           Tuesday
2      CDD           180         Wednesday

In [151]:
merged_sheet = pd.merge(sample_sheet_1, sample_sheet_2, on='Location')

merged_sheet

,Location,Population,House_count,Location Area,No. of shops,Weekly market day
0,ABB,2.5 lakh,763,25 hectare,150,Nothing as such
1,ABC,1.5 lakh,520,20 hectare,120,Tuesday
2,CDD,3.5 lakh,800,35 hectare,180,Wednesday